org/2023-08-26-nokia-105-note.org
* Nokia 105(2G) Note

I buy a new nokia 105(not 4G) from taobao:

https://www.nokia.com/phones/en_int/nokia-105?sku=1GF019CPA2L05

https://www.nokia.com/phones/en_int/nokia-105/specs?sku=1GF019CPA2L05

** usb

plug on computer, it provide a usb 1.1 device:

#+BEGIN_SRC
[115415.430562] usb 1-1.8.6: new full-speed USB device number 22 using ehci-pci
#+END_SRC

when we shutdown the phone:

#+BEGIN_SRC
[119569.012805] usb 1-1.8.6: new full-speed USB device number 24 using ehci-pci
[119569.121561] usb 1-1.8.6: New USB device found, idVendor=1782, idProduct=4d00, bcdDevice= 0.01
[119569.121581] usb 1-1.8.6: New USB device strings: Mfr=0, Product=0, SerialNumber=0
[119573.907466] usb 1-1.8.6: USB disconnect, device number 24
#+END_SRC

lsusb:

#+BEGIN_SRC
Bus 001 Device 032: ID 1782:4d00 Spreadtrum Communications Inc.
#+END_SRC

it look like flash mode for this phone :)

I found some web site for this usb device id:

https://treexy.com/products/driver-fusion/database/ports-com-lpt-serial/spreadtrum/sci-usb2serial/

https://www.getdroidtips.com/download-latest-spreadtrum-usb-drivers/

https://blog.masoomyf.com/2017/12/download-spreadtrum-mtk-driver-64bit.html

https://forum.gsmhosting.com/vbb/f1110/error-nokia-c3-ta-1298-solved-3103747/

https://forum.gsmhosting.com/vbb/f723/sci-usb-serial-driver-win7-64bit-1924923/

https://techprolonged.com/2015/03/install-mediatek-mt65xx-usb-vcom-drivers-for-windows-all/

https://forum.gsmhosting.com/vbb/f1110/nokia-g21-error-42-solved-3106775/

https://github.com/HowToLoveChina/InkCaseMe/wiki/InkCase--Plus

https://github.com/TomKing062/CVE-2022-38694_unlock_bootloader/wiki/

https://research.nccgroup.com/2022/09/02/theres-another-hole-in-your-soc-unisoc-rom-vulnerabilities/

https://github.com/cocktail828/dloader

** screen

https://github.com/Abhishektiwari7/lcd_nokia_105_drivers/tree/master

I'm not sure it's this one, when I buy a new one, take a logic analyzer to capture the data on the screen.

** firmware

NOT FOUND

** chip

may be Mediatek MT6261D, Wait till I buy another one for reverse engineering.

MT626X datasheet:

https://ia801603.us.archive.org/16/items/mediatek_202304/MT6261D_GSM_GPRS_SOC_Processor_Technical_Brief_v1.01.pdf

https://datasheet4u.com/datasheet-pdf/MEDIATEK/MT6261D/pdf.php?id=1266527

https://www.alldatasheet.com/view.jsp?Searchword=MT6260


some useful site for mt626X:

https://www.dr-lex.be/hardware/china_phone_flashing.html

https://www.cnx-software.com/2015/11/24/no-1-d3-smartwatch-review/

https://forum.xda-developers.com/t/universal-readback-extractor-for-mtk-feature-watchphones.3289272/

https://www.kosagi.com/w/index.php?title=Fernvale_Main_Page

MT626X programming guide:

NOT FOUND

MT626X project:

https://github.com/MediatekInfo/DZ09

https://github.com/waybyte/tool-pymtkflasher

https://github.com/Wiz-IO/wizio-mtk

https://github.com/xobs/fernly


