2023-08-26-nokia-105-note.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Lu Hui" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org2320f22" class="outline-2">
<h2 id="org2320f22">Nokia 105(2G) Note</h2>
<div class="outline-text-2" id="text-org2320f22">
<p>
I buy a new nokia 105(not 4G) from taobao:
</p>

<p>
<a href="https://www.nokia.com/phones/en_int/nokia-105?sku=1GF019CPA2L05">https://www.nokia.com/phones/en_int/nokia-105?sku=1GF019CPA2L05</a>
</p>

<p>
<a href="https://www.nokia.com/phones/en_int/nokia-105/specs?sku=1GF019CPA2L05">https://www.nokia.com/phones/en_int/nokia-105/specs?sku=1GF019CPA2L05</a>
</p>
</div>

<div id="outline-container-orgb9ee5d1" class="outline-3">
<h3 id="orgb9ee5d1">usb</h3>
<div class="outline-text-3" id="text-orgb9ee5d1">
<p>
plug on computer, it provide a usb 1.1 device:
</p>

<pre class="example">
<code>[115415.430562] usb 1-1.8.6: new full-speed USB device number 22 using ehci-pci</code>
</pre>

<p>
when we shutdown the phone:
</p>

<pre class="example">
<code>[119569.012805] usb 1-1.8.6: new full-speed USB device number 24 using ehci-pci</code>
<code>[119569.121561] usb 1-1.8.6: New USB device found, idVendor=1782, idProduct=4d00, bcdDevice= 0.01</code>
<code>[119569.121581] usb 1-1.8.6: New USB device strings: Mfr=0, Product=0, SerialNumber=0</code>
<code>[119573.907466] usb 1-1.8.6: USB disconnect, device number 24</code>
</pre>

<p>
lsusb:
</p>

<pre class="example">
<code>Bus 001 Device 032: ID 1782:4d00 Spreadtrum Communications Inc.</code>
</pre>

<p>
it look like flash mode for this phone :)
</p>

<p>
I found some web site for this usb device id:
</p>

<p>
<a href="https://treexy.com/products/driver-fusion/database/ports-com-lpt-serial/spreadtrum/sci-usb2serial/">https://treexy.com/products/driver-fusion/database/ports-com-lpt-serial/spreadtrum/sci-usb2serial/</a>
</p>

<p>
<a href="https://www.getdroidtips.com/download-latest-spreadtrum-usb-drivers/">https://www.getdroidtips.com/download-latest-spreadtrum-usb-drivers/</a>
</p>

<p>
<a href="https://blog.masoomyf.com/2017/12/download-spreadtrum-mtk-driver-64bit.html">https://blog.masoomyf.com/2017/12/download-spreadtrum-mtk-driver-64bit.html</a>
</p>

<p>
<a href="https://forum.gsmhosting.com/vbb/f1110/error-nokia-c3-ta-1298-solved-3103747/">https://forum.gsmhosting.com/vbb/f1110/error-nokia-c3-ta-1298-solved-3103747/</a>
</p>

<p>
<a href="https://forum.gsmhosting.com/vbb/f723/sci-usb-serial-driver-win7-64bit-1924923/">https://forum.gsmhosting.com/vbb/f723/sci-usb-serial-driver-win7-64bit-1924923/</a>
</p>

<p>
<a href="https://techprolonged.com/2015/03/install-mediatek-mt65xx-usb-vcom-drivers-for-windows-all/">https://techprolonged.com/2015/03/install-mediatek-mt65xx-usb-vcom-drivers-for-windows-all/</a>
</p>

<p>
<a href="https://forum.gsmhosting.com/vbb/f1110/nokia-g21-error-42-solved-3106775/">https://forum.gsmhosting.com/vbb/f1110/nokia-g21-error-42-solved-3106775/</a>
</p>

<p>
<a href="https://github.com/HowToLoveChina/InkCaseMe/wiki/InkCase--Plus">https://github.com/HowToLoveChina/InkCaseMe/wiki/InkCase--Plus</a>
</p>

<p>
<a href="https://github.com/TomKing062/CVE-2022-38694_unlock_bootloader/wiki/">https://github.com/TomKing062/CVE-2022-38694_unlock_bootloader/wiki/</a>
</p>

<p>
<a href="https://research.nccgroup.com/2022/09/02/theres-another-hole-in-your-soc-unisoc-rom-vulnerabilities/">https://research.nccgroup.com/2022/09/02/theres-another-hole-in-your-soc-unisoc-rom-vulnerabilities/</a>
</p>

<p>
<a href="https://github.com/cocktail828/dloader">https://github.com/cocktail828/dloader</a>
</p>
</div>
</div>

<div id="outline-container-org120893a" class="outline-3">
<h3 id="org120893a">screen</h3>
<div class="outline-text-3" id="text-org120893a">
<p>
<a href="https://github.com/Abhishektiwari7/lcd_nokia_105_drivers/tree/master">https://github.com/Abhishektiwari7/lcd_nokia_105_drivers/tree/master</a>
</p>

<p>
I&rsquo;m not sure it&rsquo;s this one, when I buy a new one, take a logic analyzer to capture the data on the screen.
</p>
</div>
</div>

<div id="outline-container-org2f51523" class="outline-3">
<h3 id="org2f51523">firmware</h3>
<div class="outline-text-3" id="text-org2f51523">
<p>
NOT FOUND
</p>
</div>
</div>

<div id="outline-container-orgda85b51" class="outline-3">
<h3 id="orgda85b51">chip</h3>
<div class="outline-text-3" id="text-orgda85b51">
<p>
may be Mediatek MT6261D, Wait till I buy another one for reverse engineering.
</p>

<p>
MT626X datasheet:
</p>

<p>
<a href="https://ia801603.us.archive.org/16/items/mediatek_202304/MT6261D_GSM_GPRS_SOC_Processor_Technical_Brief_v1.01.pdf">https://ia801603.us.archive.org/16/items/mediatek_202304/MT6261D_GSM_GPRS_SOC_Processor_Technical_Brief_v1.01.pdf</a>
</p>

<p>
<a href="https://datasheet4u.com/datasheet-pdf/MEDIATEK/MT6261D/pdf.php?id=1266527">https://datasheet4u.com/datasheet-pdf/MEDIATEK/MT6261D/pdf.php?id=1266527</a>
</p>

<p>
<a href="https://www.alldatasheet.com/view.jsp?Searchword=MT6260">https://www.alldatasheet.com/view.jsp?Searchword=MT6260</a>
</p>


<p>
some useful site for mt626X:
</p>

<p>
<a href="https://www.dr-lex.be/hardware/china_phone_flashing.html">https://www.dr-lex.be/hardware/china_phone_flashing.html</a>
</p>

<p>
<a href="https://www.cnx-software.com/2015/11/24/no-1-d3-smartwatch-review/">https://www.cnx-software.com/2015/11/24/no-1-d3-smartwatch-review/</a>
</p>

<p>
<a href="https://forum.xda-developers.com/t/universal-readback-extractor-for-mtk-feature-watchphones.3289272/">https://forum.xda-developers.com/t/universal-readback-extractor-for-mtk-feature-watchphones.3289272/</a>
</p>

<p>
<a href="https://www.kosagi.com/w/index.php?title=Fernvale_Main_Page">https://www.kosagi.com/w/index.php?title=Fernvale_Main_Page</a>
</p>

<p>
MT626X programming guide:
</p>

<p>
NOT FOUND
</p>

<p>
MT626X project:
</p>

<p>
<a href="https://github.com/MediatekInfo/DZ09">https://github.com/MediatekInfo/DZ09</a>
</p>

<p>
<a href="https://github.com/waybyte/tool-pymtkflasher">https://github.com/waybyte/tool-pymtkflasher</a>
</p>

<p>
<a href="https://github.com/Wiz-IO/wizio-mtk">https://github.com/Wiz-IO/wizio-mtk</a>
</p>

<p>
<a href="https://github.com/xobs/fernly">https://github.com/xobs/fernly</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Last updated: 2023-08-26</p>
</div>
</body>
</html>